deleted the weird diagra,=m
